{
  "generated": "2026-02-11T09:00:33.473Z",
  "voice": {
    "id": "Xb7hH8MSUJpSbSDYk0k2",
    "name": "Alice",
    "accent": "British",
    "style": "clear educator"
  },
  "script": "Right then, here's what's happening in the world today.\n\nGood morning. Here's the state of play:\n\nCanada is reeling from a deadly school shooting that shattered the quiet of Tumbler Ridge, British Columbia. Nine people were killed at a high school and related residence, with at least 25 others injured, before the shooter apparently took their own life. The attack has jolted this peaceful mountain town and reignited conversations about gun violence just six years after Canada implemented major reforms following its deadliest mass shooting in 2020.\n\nThe shooting is dominating international coverage today, with outlets from the BBC to The Economist leading with the story. It's a stark reminder that even countries with stricter gun laws aren't immune to such tragedies, and it comes as other democracies grapple with their own challenges around political polarization and social tensions.\n\nBusiness/Tech\n\n• Elon Musk wants to build an A.I. satellite factory on the Moon, part of his expanding vision for space-based manufacturing. The proposal would combine his interests in artificial intelligence and space exploration in a way that sounds like science fiction but increasingly feels like Musk's standard playbook.\n\n• Heineken is planning to cut 6,000 jobs as beer demand continues to weaken, according to Reuters. The Dutch brewer is feeling pressure from changing consumer habits and economic headwinds across key markets.\n\n• Samsung expects memory chip demand to remain strong through 2027, Reuters reports. A Samsung executive says the AI boom continues driving appetite for advanced chips, offering a bright spot for the tech sector.\n\nAround the World\n\n• Latin America: Guatemala is phasing out the use of Cuban doctors under pressure from the U.S. The move affects hundreds of medical professionals who've been working in rural areas where local doctors are scarce, highlighting how Washington's Cuba policies ripple across the region.\n\n• Europe: King Charles isn't giving up on climate advocacy despite his cancer diagnosis, appearing in a new documentary about environmental challenges. The king continues pushing his longstanding environmental agenda even as he manages his health and royal duties.\n\n• Asia: Hong Kong has convicted the father of a political exile for the first time, marking a new escalation in Beijing's crackdown on dissent. The case against Anna Kwok's father shows how authorities are expanding their reach to family members of overseas activists.\n\n• Middle East: Hamas would keep some weapons initially under a draft Gaza plan, officials say. The detail highlights one of the key sticking points in ongoing negotiations as Trump prepares to meet with Netanyahu this week.\n\n• Africa: Two Senegalese celebrities were arrested in a crackdown on homosexuality, reflecting growing tensions over LGBTQ+ rights across West Africa. The arrests have sparked debate in a country that's generally been more tolerant than some of its neighbors.\n\nThat's your world update for today.",
  "size_kb": 3221
}