{
  "generated": "2026-02-16T03:04:44.699Z",
  "voice": {
    "id": "Xb7hH8MSUJpSbSDYk0k2",
    "name": "Alice",
    "accent": "British",
    "style": "clear educator"
  },
  "script": "Right then, here's what's happening in the world today.\n\nGood morning. Here's the state of play:\n\nThe Trump administration's approach to diplomacy is taking some unusual turns. U.S. embassies are now raising private cash for lavish July Fourth parties, following the president's own fundraising model. It's part of a broader pattern that's creating ripples internationally, especially at the Munich Security Conference where three different American speeches left allies confused about U.S. positions.\n\nThe diplomatic confusion comes as allies are already making their own moves. Canada is giving U.S. arms makers the cold shoulder on military spending, choosing to invest domestically instead. Meanwhile, U.S. lawmakers at Munich are acknowledging that Trump's Greenland threats have left lasting diplomatic scars that won't easily heal.\n\nBusiness/Tech\n\n• A.I. workers are making so much money that they're getting prenups to protect their new wealth. The compensation boom in artificial intelligence is creating relationship tensions and financial planning challenges.\n\n• Meta is planning to add facial recognition to its smart glasses, raising privacy concerns about real-time identification capabilities in everyday interactions.\n\n• The Trump administration killed tax credits for start-stop engine features in vehicles, part of the broader rollback of environmental incentives.\n\n• Bloomberg reports that Chinese stocks Laopu Gold and CMOC are rallying sharply after being added to Hong Kong's benchmark Hang Seng Index.\n\nAround the World\n\n• Latin America: Brazil made Olympic history by claiming its first-ever gold at a Winter Olympics, alongside Kazakhstan's surprise victory. The wins represent major breakthroughs for countries not traditionally associated with winter sports.\n\n• Europe: EU Vice President Kaja Kallas pushed back hard against Trump administration claims that Europe faces \"civilizational erasure,\" telling officials that Europe today looks very different from what Washington describes.\n\n• Asia: Japan's economy is taking a hit from its diplomatic feud with China, particularly in tourism and trade sectors where Chinese participation has dropped significantly.\n\n• Middle East: An Iranian protester's death in custody has sparked outrage, with his family believing he was effectively executed. The case has galvanized opposition groups demanding accountability from Tehran. Al Jazeera reports that Israel approved plans to register West Bank lands as state property, which Palestinians are calling de facto annexation.\n\n• Africa: The Trump administration secretly deported nine migrants to Cameroon while ignoring legal protections that should have prevented their removal, raising questions about due process in immigration enforcement.\n\nThat's your world update for today.",
  "size_kb": 2971
}