{
  "generated": "2026-02-06T01:09:34.304Z",
  "voice": {
    "id": "Xb7hH8MSUJpSbSDYk0k2",
    "name": "Alice",
    "accent": "British",
    "style": "clear educator"
  },
  "script": "Right then, here's what's happening in the world today.\n\nGood morning. Here's the state of play:\n\nCrypto's taking a beating despite Trump's vocal support, with Bitcoin sliding below $67,000 and dragging the whole digital asset market down with it. It's a reality check for anyone who thought presidential cheerleading alone could prop up speculative investments. The selloff is part of a broader tech rout that's got investors spooked about valuations across the board.\n\nMeanwhile, Trump's continuing his federal workforce overhaul, expanding his authority to fire career civil servants. It's the latest step in what looks like a systematic effort to reshape how the federal government operates. On Capitol Hill, senators are clashing over immigration enforcement funding, raising the specter of a Department of Homeland Security shutdown if they can't find common ground.\n\nBusiness/Tech\n\n• Amazon's doubling down with a $200 billion AI spending plan that puts serious money behind the artificial intelligence arms race. It's a massive bet that AI infrastructure will pay off in the long run.\n\n• Tech stocks are getting hammered across Asia as the selloff that started in the U.S. spreads globally, according to Bloomberg. South Korean markets are taking it particularly hard.\n\n• Reddit's beating revenue forecasts as AI tools help boost ad sales, per Reuters. At least someone's making money off the AI boom.\n\nAround the World\n\n• Latin America: Mexico's tequila mayor is in hot water, accused of shaking down the very tequila companies that put his town on the map. You really can't make this stuff up.\n\n• Europe: Italy just toughened protest laws hours before planned Winter Olympics rallies, creating a tense backdrop for what's supposed to be a celebration of international sport.\n\n• Asia: Pakistan's military launched an operation that displaced thousands, but here's the twist: Islamabad claims it never ordered the offensive. The disconnect between military action and civilian authority is deeply troubling.\n\n• Middle East: Iranian Nobel laureate Narges Mohammadi has started another hunger strike from prison, highlighting the regime's continued crackdown on dissent even as the BBC reports that US-Iran talks are set to begin.\n\n• Africa: Gunmen killed more than 160 people in Nigeria, according to aid officials, another reminder of the security challenges plaguing parts of West Africa.\n\nThat's your world update for today.",
  "size_kb": 2626
}