{
  "generated": "2026-02-10T15:10:13.445Z",
  "voice": {
    "id": "Xb7hH8MSUJpSbSDYk0k2",
    "name": "Alice",
    "accent": "British",
    "style": "clear educator"
  },
  "script": "Right then, here's what's happening in the world today.\n\nGood morning. Here's the state of play:\n\nAfter more than a year of grinding warfare, Russia appears to be on the verge of capturing key towns in eastern Ukraine, including strategic positions near Huliaipole and Pokrovsk. These gains would represent some of Moscow's most significant territorial advances since the early months of the invasion, potentially giving Russian forces better supply lines and launching points for future operations.\n\nThe human cost of the prolonged conflict is becoming increasingly stark in Ukraine's cities. In Kyiv, residents are resorting to sleeping in tents inside their own beds to stay warm as power outages leave much of the capital without heat during the brutal winter months. It's a vivid reminder of how the war continues to reshape daily life far from the front lines.\n\nBusiness/Tech\n• Alphabet is raising nearly $32 billion in debt as tech companies scramble to fund their AI ambitions, according to Bloomberg. The massive bond sale shows just how expensive the artificial intelligence race has become.\n\n• A landmark trial is underway with lawyers arguing that Meta and YouTube have created \"digital casinos\" designed to addict children's brains. The case could reshape how social media platforms operate.\n\n• BP suspended its share buybacks after profits slumped, reflecting broader challenges in the energy sector as oil prices remain volatile.\n\n• Novo Nordisk opened a new legal front, filing patent suits against Hims over Wegovy copies, Reuters reports.\n\nAround the World\n• Latin America: Trump's threats to sanction Cuba's oil suppliers are putting Mexico in an uncomfortable position, forcing the country to choose between maintaining energy ties with Havana and avoiding U.S. penalties.\n\n• Europe: Emmanuel Macron urged Europe to start acting like a world power, warning of growing threats from China, Russia, and now the United States, the BBC reports. The French president called it a \"wake-up call\" for the continent.\n\n• Asia: Durian farmers in Malaysia who made fortunes selling the pungent fruit to China are now watching their crops pile up as demand from Chinese consumers has unexpectedly cooled.\n\n• Middle East: Israeli forces are set to remove electricity networks in an occupied West Bank town west of Hebron, Al Jazeera reports, as Israel deepens its control over the territory.\n\n• Africa: Two Senegalese celebrities were arrested in a government crackdown targeting homosexuality, highlighting the country's increasingly harsh stance on LGBTQ+ rights.\n\nThat's your world update for today.",
  "size_kb": 2802
}