{
  "generated": "2026-02-15T12:54:04.692Z",
  "voice": {
    "id": "Xb7hH8MSUJpSbSDYk0k2",
    "name": "Alice",
    "accent": "British",
    "style": "clear educator"
  },
  "script": "Right then, here's what's happening in the world today.\n\nGood morning. Here's the state of play:\n\nThe Department of Homeland Security is staring down a potential funding crisis that could disrupt everything from TSA operations to immigration enforcement. The standoff comes as the Trump administration pushes an aggressive domestic agenda, with students across the country walking out to protest ICE raids while Texas threatens to punish schools that allow such demonstrations.\n\nThe international picture is equally tense. European leaders are pushing back hard against American claims that Europe faces \"civilizational erasure.\" EU Vice President Kaja Kallas led the charge, according to reports from European outlets. Meanwhile, the UK says Russia killed opposition leader Alexei Navalny using dart frog toxin, calling for international action against Moscow. In Gaza, at least 11 people were killed in Israeli strikes over the past day, the BBC reports.\n\nBusiness/Tech\n\n• The Homeland Security Department wants social media companies to expose accounts that are organizing anti-ICE activities, raising fresh questions about government surveillance of digital platforms.\n\n• AI anxiety is taking over corporate earnings calls even as companies post strong quarterly numbers. Bloomberg reports that executives are spending more time talking about AI threats than celebrating profit growth.\n\n• European Central Bank President Christine Lagarde is arguing against capital controls, telling Bloomberg that Europe should focus on creating investment incentives rather than taxes to prevent money from fleeing to other regions.\n\nAround the World\n\n• Latin America: Brazil is having its Olympic moment at the Winter Games, claiming surprise gold medals alongside Kazakhstan in what's being called an Olympics of firsts for unlikely winter sports nations.\n\n• Europe: Ever wonder where Olympic champions actually keep their medals? Turns out many of them end up in sock drawers and kitchen cabinets rather than trophy cases, according to interviews with medalists.\n\n• Asia: The student revolution that toppled Bangladesh's government is getting overshadowed by the rising influence of Islamist parties, raising questions about the long-term direction of the country's democratic transition.\n\n• Middle East: A young Iranian protester's death in custody has sparked outrage after his family said they believe he was executed rather than killed in an accident, fueling fresh demonstrations against the regime.\n\n• Africa: South Sudan's government arrested a well-known peace activist for allegedly plotting a coup, in a case that's raising eyebrows given the man's reputation for promoting reconciliation in the war-torn country.\n\nThat's your world update for today.",
  "size_kb": 2939
}