{
  "generated": "2026-02-15T12:53:13.631Z",
  "voice": {
    "id": "Xb7hH8MSUJpSbSDYk0k2",
    "name": "Alice",
    "accent": "British",
    "style": "clear educator"
  },
  "script": "Right then, here's what's happening in the world today.\n\nGood morning. Here's the state of play:\n\nThe U.S. is grappling with a Homeland Security funding crisis that's threatening critical operations, including TSA screening at airports. This comes as the administration faces mounting challenges over immigration enforcement, with students across the country staging walkouts to protest ICE raids while Texas moves to punish schools that don't crack down on the demonstrations.\n\nMeanwhile, the Pentagon and FAA are locked in a bureaucratic battle that led to the closure of El Paso's airspace, with sources telling AP the dispute centers on laser systems designed to counter cartel drones. The administration is also quietly deporting migrants while ignoring legal protections, raising concerns about due process in the escalated enforcement efforts.\n\nBusiness/Tech\n\n• DHS is pressuring social media companies to hand over information about accounts that oppose ICE operations, marking a significant expansion of surveillance efforts targeting immigration activism.\n\n• A.I. is reshaping how we experience the internet, with tech giants rolling out personalized algorithms that users can't easily opt out of, fundamentally changing how information reaches us.\n\n• The U.S. has approved HALEU uranium use for reactor fuel production, per Reuters, as the nuclear industry pushes forward with next-generation technology.\n\n• Corporate earnings calls are increasingly dominated by A.I. concerns, with executives and investors fixated on automation threats despite strong earnings growth, Bloomberg reports.\n\nAround the World\n\n• Latin America: Brazil claimed its first Winter Olympics gold medal in a stunning upset, while Kazakhstan also secured a surprise victory in what's being called an Olympics of firsts for unexpected nations.\n\n• Europe: EU Commission Vice-President Kaja Kallas pushed back hard against American claims of European \"civilizational erasure,\" with European leaders rejecting the U.S. national defense document's framing, according to AP.\n\n• Asia: An Islamist party's growing influence is overshadowing student revolutionaries in Bangladesh, complicating the political landscape months after the youth-led uprising that toppled the previous government.\n\n• Middle East: Iran's deputy foreign minister told the BBC that Tehran is ready to discuss compromises on a nuclear deal, saying the ball is \"in America's court\" to prove serious intentions for negotiations.\n\n• Africa: Nigeria has received its first U.S. troops as part of an expanded counterterrorism partnership, marking a significant military commitment under the new administration.\n\nThat's your world update for today.",
  "size_kb": 2945
}