{
  "generated": "2026-02-15T11:15:32.581Z",
  "voice": {
    "id": "Xb7hH8MSUJpSbSDYk0k2",
    "name": "Alice",
    "accent": "British",
    "style": "clear educator"
  },
  "script": "Right then, here's what's happening in the world today.\n\nGood morning. Here's the state of play:\n\nWashington is grappling with a Homeland Security funding crisis that could disrupt airport security and immigration enforcement. The standoff reflects broader tensions over Trump's aggressive deportation agenda, which has sparked student protests nationwide and raised questions about how far federal agencies can push their enforcement powers.\n\nThe funding fight comes as the administration faces scrutiny over its immigration tactics. The U.S. secretly deported nine migrants to Cameroon while ignoring legal protections, and Homeland Security is now demanding social media platforms reveal anti-ICE accounts. The political fallout is reshaping Democratic messaging, with the party split between calls to \"abolish ICE\" versus reforming Trump's version of the agency.\n\nBusiness/Tech\n\n• The romance novel industry is getting an unwelcome makeover as A.I. translations flood the market with cheap alternatives to human translators, raising questions about quality and jobs.\n\n• Iran is deploying digital surveillance tools including facial recognition to track down protesters, showing how authoritarian regimes are weaponizing tech against dissent.\n\n• A.I. companies are quietly personalizing your internet experience without giving you any say in how the algorithms work, Bloomberg reports that A.I. risk is dominating earnings calls as investors dump tech stocks.\n\n• The U.S. has authorized Triso-X to use enriched uranium for reactor fuel production, per Reuters.\n\nAround the World\n\n• Latin America: Brazil just claimed its first-ever Winter Olympics gold medal alongside Kazakhstan, marking a historic breakthrough for countries not traditionally associated with winter sports.\n\n• Europe: A new memoir by Gisèle Pelicot explains why she refused to be seen as a victim during her landmark sexual assault trial that captivated France and beyond.\n\n• Asia: An Islamist party's growing influence in Bangladesh is overshadowing the student revolution that toppled the previous government, raising questions about the country's secular future.\n\n• Middle East: The death of an Iranian protester in custody has sparked fresh outrage, with his family believing he was executed. The BBC reports Iran's deputy foreign minister says the country is ready to discuss compromises on a nuclear deal.\n\n• Africa: A South Sudanese peace activist was caught plotting a coup, highlighting the complex dynamics in one of the world's youngest nations where the line between peace and politics often blurs.\n\nThat's your world update for today.",
  "size_kb": 2842
}