{
  "generated": "2026-02-11T15:03:04.633Z",
  "voice": {
    "id": "Xb7hH8MSUJpSbSDYk0k2",
    "name": "Alice",
    "accent": "British",
    "style": "clear educator"
  },
  "script": "Right then, here's what's happening in the world today.\n\nGood morning. Here's the state of play:\n\nThe most surprising story today isn't coming from traditional newsrooms but from prediction markets, where amateur gamblers are consistently outperforming Wall Street's most credentialed economists. These everyday traders, betting small amounts on economic outcomes, have been more accurate at forecasting everything from inflation rates to employment numbers than PhD economists at major investment banks. It's a fascinating glimpse into how crowdsourced wisdom might be reshaping how we think about economic forecasting.\n\nMeanwhile, Canada is grappling with one of its deadliest mass shootings in recent history. Nine people were killed and 25 injured in attacks at a school and residence in Tumbler Ridge, British Columbia. Students and teachers barricaded themselves in classrooms for hours during the ordeal. The tragedy comes despite Canada's significant gun control reforms following its 2020 mass shooting.\n\nBusiness/Tech\n\nElon Musk wants to build an A.I. satellite factory on the moon, part of his expanding vision for space-based manufacturing and artificial intelligence infrastructure.\n\nThe CEO of Boston Dynamics is stepping down as Hyundai refocuses its robotics strategy, Reuters reports.\n\nThe S&P 500 is heading toward record territory after today's stronger-than-expected jobs report eased concerns about consumer spending, according to Bloomberg.\n\nBritain's grid operator will reset timetables for as many as 210 clean power projects, potentially jeopardizing the government's 2030 clean energy targets, Bloomberg notes.\n\nAround the World\n\nLatin America: The mayor of Tumbler Ridge says he'll \"know every victim\" personally from yesterday's mass shooting, underscoring how the tragedy has devastated this close-knit community in rural British Columbia.\n\nEurope: NATO is stepping up its Arctic security presence as geopolitical tensions with Russia intensify in the strategically important northern region.\n\nAsia: Bangladesh holds crucial elections on Thursday that could reshape the country's political landscape after months of uncertainty.\n\nMiddle East: A draft Gaza plan would allow Hamas to keep some weapons initially, according to officials familiar with the negotiations, marking a significant development in ceasefire talks.\n\nAfrica: Senegal has arrested two prominent celebrities as part of an intensifying crackdown on homosexuality that's raising concerns about human rights in the West African nation.\n\nThat's your world update for today.",
  "size_kb": 2784
}