{
  "generated": "2026-02-15T12:54:28.331Z",
  "voice": {
    "id": "Xb7hH8MSUJpSbSDYk0k2",
    "name": "Alice",
    "accent": "British",
    "style": "clear educator"
  },
  "script": "Right then, here's what's happening in the world today.\n\nGood morning. Here's the state of play:\n\nThe U.S. government is facing another potential crisis as Homeland Security funding hangs in the balance. The standoff threatens to disrupt critical operations just as the administration ramps up immigration enforcement. TSA operations and border security could be affected if Congress doesn't act soon.\n\nMeanwhile, the administration is doubling down on its hardline immigration approach. The U.S. secretly deported nine migrants to Cameroon while ignoring their legal protections, and students across the country are walking out in protest of ICE operations. Texas lawmakers want to punish schools that allow these demonstrations. The El Paso airspace closure has added another wrinkle to border operations, with the Pentagon and FAA clashing over anti-drone laser systems.\n\nBusiness/Tech\n\n• Homeland Security is demanding that social media platforms expose accounts that organize against ICE operations, raising fresh questions about free speech and surveillance.\n\n• AI translation tools are starting to disrupt professional translators, with French romance novels serving as an unexpected testing ground for the technology's limits.\n\n• A private ICE contractor is facing scrutiny over poor medical care at detention facilities, with sick detainees describing inadequate treatment.\n\n• Iran is ramping up its digital surveillance to track down protesters, using facial recognition and other tools to crack down on dissent.\n\nAround the World\n\n• Latin America: Brazil claimed a surprise gold medal at the Winter Olympics, marking another historic first for the country in winter sports alongside Kazakhstan's breakthrough performance.\n\n• Europe: Olympic medalists apparently keep their hardware in surprisingly mundane places, with many champions stashing their gold in sock drawers and kitchen cabinets rather than display cases.\n\n• Asia: Bangladesh's student revolution is being overshadowed by the rising influence of Islamist parties, complicating the country's political transition after the youth-led uprising.\n\n• Middle East: An Iranian protester's death in custody has sparked outrage, with his family believing Ali Rahbar was executed by authorities rather than dying from natural causes.\n\n• Africa: A South Sudanese peace activist was caught plotting a coup, highlighting the contradictions and desperation in one of the world's youngest nations.\n\nThat's your world update for today.",
  "size_kb": 2645
}