{
  "generated": "2026-02-10T17:03:42.068Z",
  "voice": {
    "id": "Xb7hH8MSUJpSbSDYk0k2",
    "name": "Alice",
    "accent": "British",
    "style": "clear educator"
  },
  "script": "Right then, here's what's happening in the world today.\n\nGood morning. Here's the state of play:\n\nImmigration enforcement is hitting some legal speed bumps as the Trump administration ramps up deportations. An immigration judge ruled that the government cannot deport a Tufts University student, marking an early judicial pushback against the administration's expanded removal efforts. It's part of a broader pattern where D.H.S. claims about deportation cases are unraveling when they face courtroom scrutiny.\n\nMeanwhile, the war in Ukraine continues its grinding trajectory. Russian forces are closing in on key Ukrainian towns after months of sustained assaults, while residents in Kyiv are finding creative ways to stay warm without reliable electricity. The battlefield momentum comes as peace negotiations remain in the background and Trump weighs his reconstruction plans for the country.\n\nBusiness/Tech\n\n• Meta and YouTube are facing a landmark trial where lawyers argue the platforms created digital casinos designed to hook users, particularly young people.\n\n• Google employees are demanding the company end its cloud services for immigration agencies as ICE operations expand nationwide.\n\n• Datadog beat quarterly earnings estimates thanks to AI-driven demand for cloud security services, Reuters reports.\n\n• Marriott is forecasting weak room revenue growth as US travel demand softens, according to Reuters.\n\nAround the World\n\n• Latin America: Mexico finds itself caught between Trump's threats to sanction countries that supply oil to Cuba and its own energy relationships in the region, creating a diplomatic balancing act for the new administration.\n\n• Europe: Olympic officials banned a Ukrainian skeleton racer's helmet that honored war dead, sparking controversy over how much politics should be allowed at the Milan Winter Olympics.\n\n• Asia: Malaysian durian farmers who made fortunes when Chinese demand exploded are now watching the prized fruit pile up unsold as market dynamics shift.\n\n• Middle East: Israeli President Isaac Herzog's visit to Australia created a diplomatic tinderbox, with protests and arrests highlighting how the Gaza war continues to inflame tensions globally.\n\n• Africa: Senegalese authorities arrested two celebrities in a widening crackdown on homosexuality, reflecting growing conservative pressure in the West African nation.\n\nThat's your world update for today.",
  "size_kb": 2600
}