{
  "generated": "2026-02-12T12:11:27.563Z",
  "voice": {
    "id": "Xb7hH8MSUJpSbSDYk0k2",
    "name": "Alice",
    "accent": "British",
    "style": "clear educator"
  },
  "script": "Right then, here's what's happening in the world today.\n\nGood morning. Here's the state of play:\n\nThe U.S.-Mexico border is making headlines for an unexpected reason. A Border Agency laser designed to take down drones apparently caused the shutdown of El Paso's airspace this week. The incident highlights a growing challenge as the Trump administration ramps up border enforcement: anti-drone weapons don't play nicely with commercial aviation.\n\nMeanwhile, Bangladesh wrapped up voting in what could be a watershed election. Al Jazeera reports that polls closed with counting now underway in the first democratic contest since Gen Z-led protests toppled Sheikh Hasina's authoritarian government. It's the kind of moment that could reshape South Asian politics, with voters hoping for a genuine return to democratic governance after 15 years of increasingly repressive rule.\n\nBusiness/Tech\nSoftBank swung back to quarterly profit, with its OpenAI bet generating nearly $20 billion in investment gains, Bloomberg reports. That's a massive vindication for Masayoshi Son's latest AI gamble.\nAmateur traders are outpredicting Wall Street Ph.D.s on economic forecasts, using prediction markets to beat traditional analysts at their own game.\nInstagram's head testified that social media isn't \"clinically addictive\" in a landmark trial that could reshape how we think about tech platforms and mental health.\nOpenAI's biggest challenge isn't building better AI models but figuring out how to turn all that technological prowess into sustainable revenue streams.\n\nAround the World\nLatin America: A top U.S. energy official is pressing Venezuela to do more to encourage foreign investment, particularly in its oil sector, as Washington tries to balance sanctions with energy market stability.\nEurope: Former U.S. ambassadors and generals are defending NATO as vital to American security, pushing back against any suggestion the alliance has outlived its usefulness.\nAsia: South Korea's spy agency says Kim Jong Un has chosen his teenage daughter as his heir, according to the BBC. Ki Ju Ae's increasingly prominent public role apparently signals her position in the succession plan.\nMiddle East: Hamas would keep some weapons initially under a draft Gaza plan being discussed by officials, suggesting the group isn't ready for complete disarmament even in a potential ceasefire deal.\nAfrica: Two Senegalese celebrities were arrested in a crackdown on homosexuality, highlighting the ongoing persecution of LGBTQ+ individuals across much of the continent.\n\nThat's your world update for today.",
  "size_kb": 2703
}