{
  "generated": "2026-02-11T14:45:06.497Z",
  "voice": {
    "id": "Xb7hH8MSUJpSbSDYk0k2",
    "name": "Alice",
    "accent": "British",
    "style": "clear educator"
  },
  "script": "Right then, here's what's happening in the world today.\n\nGood morning. Here's the state of play:\n\nThe financial world is wrestling with an uncomfortable truth: thousands of amateur traders on prediction markets are consistently outperforming Wall Street analysts when it comes to economic forecasting. These everyday gamblers, armed with little more than internet access and betting instincts, are beating PhD economists at their own game. It's raising serious questions about how we value expertise in an age where crowd wisdom can trump institutional knowledge.\n\nMeanwhile, a devastating mass shooting in the small Canadian town of Tumbler Ridge has left nine people dead and 25 injured, making it one of the deadliest attacks in the nation's history. Students and teachers hid for hours as the gunman moved between a school and related residence before reportedly taking their own life. The tight-knit community of just 2,000 people is reeling, with the mayor saying he'll likely know every victim personally.\n\nBusiness/Tech\n\n• Boston Dynamics CEO is stepping down as parent company Hyundai refocuses its robotics strategy, Reuters reports. The leadership shake-up comes as the Korean automaker looks to integrate more AI and automation into its broader business.\n\n• Russia is restricting Telegram access after the messaging app failed to comply with local laws, according to the Kremlin. It's another sign of Moscow's tightening grip on digital communications platforms.\n\n• Elon Musk wants to build an AI satellite factory on the moon, because apparently Earth-based manufacturing isn't ambitious enough. The plan would combine SpaceX's lunar capabilities with his AI ventures in what sounds like science fiction but is being pitched as serious business strategy.\n\n• Emerging market stocks are hitting record highs as investors shake off concerns about strong U.S. jobs data, Bloomberg reports. The rally suggests global appetite for risk remains strong despite economic uncertainties.\n\nAround the World\n\n• Latin America: The Tumbler Ridge massacre is forcing Canada to confront its gun violence problem again, just years after the country tightened controls following its previous worst mass shooting in 2020. The remote British Columbia community is struggling to process how such violence reached their doorstep.\n\n• Europe: NATO is stepping up its Arctic security presence as tensions with Russia continue to simmer in the region. The alliance is treating the frozen north as an increasingly important front in its strategic competition with Moscow.\n\n• Asia: Bangladesh is holding crucial elections on Thursday that could reshape the country's political landscape. Meanwhile, Hong Kong has convicted a political exile's father in an unprecedented move that extends Beijing's reach to family members of overseas activists.\n\n• Middle East: Trump and Netanyahu are meeting today with Iran and Palestine expected to dominate discussions, according to Al Jazeera. A draft Gaza plan reportedly allows Hamas to keep some weapons initially, complicating ceasefire negotiations.\n\n• Africa: Senegal has arrested two celebrities in a widening crackdown on homosexuality that's raising concerns about human rights in the West African nation. The arrests signal a troubling shift in a country once seen as relatively tolerant.\n\nThat's your world update for today.",
  "size_kb": 3602
}