{
  "generated": "2026-02-10T21:10:36.041Z",
  "voice": {
    "id": "Xb7hH8MSUJpSbSDYk0k2",
    "name": "Alice",
    "accent": "British",
    "style": "clear educator"
  },
  "script": "Right then, here's what's happening in the world today.\n\nGood morning. Here's the state of play:\n\nA former police chief has revealed that Trump told him back in 2006 that \"everyone\" knew about Jeffrey Epstein's predatory behavior. The revelation comes as part of a massive document dump that's sending shockwaves through Washington, Hollywood and beyond. The newly released Epstein files show the disgraced financier's web extended far deeper than previously known, revealing efforts to cultivate ties with Russian officials and his influence operations at Columbia and NYU.\n\nThe fallout is already hitting Trump's inner circle. Commerce Secretary Howard Lutnick has acknowledged visiting Epstein's island, while pop star Chappell Roan has left her talent agency after its founder's name surfaced in the documents. The files also reveal that Epstein directed an aide to obtain hidden video cameras, suggesting a surveillance operation that may have been used for blackmail.\n\nBusiness/Tech\n\n• A landmark trial is underway with lawyers arguing that Meta and YouTube created \"digital casinos\" designed to addict users, particularly young people.\n\n• Stellantis is looking to exit its battery venture with Samsung as electric vehicle losses mount, according to Bloomberg News.\n\n• The National Labor Relations Board has dismissed a complaint against SpaceX, giving Elon Musk's company a victory in its labor disputes.\n\n• AI concerns are creating what strategists call a buying opportunity in US software stocks, Reuters reports.\n\nAround the World\n\n• Latin America: Trump's threats against Cuba's oil suppliers are putting Mexico in an awkward position, forcing the country to balance its relationship with Washington against its ties to Havana.\n\n• Europe: Italian journalists are planning to strike over their state broadcaster's Olympic coverage blunders, including repeatedly misidentifying celebrities at Winter Games events.\n\n• Asia: Malaysian durian farmers who made fortunes when China couldn't get enough of the pungent fruit now face a different problem. The durian is piling up as demand from their biggest market has collapsed.\n\n• Middle East: Hamas would be allowed to keep some weapons initially under a draft Gaza plan being discussed by negotiators, officials say, though details remain fluid.\n\n• Africa: Senegal has arrested two celebrities in a crackdown on homosexuality that marks a sharp turn for a country once seen as relatively tolerant in the region.\n\nThat's your world update for today.",
  "size_kb": 2803
}