{
  "generated": "2026-02-12T11:55:40.510Z",
  "voice": {
    "id": "Xb7hH8MSUJpSbSDYk0k2",
    "name": "Alice",
    "accent": "British",
    "style": "clear educator"
  },
  "script": "Right then, here's what's happening in the world today.\n\nGood morning. Here's the state of play:\n\nThe Trump administration's border security operations are under scrutiny after what appears to be a significant operational mishap at El Paso International Airport. The Border Patrol's use of anti-drone laser technology apparently triggered the closure of civilian airspace, highlighting how counter-drone weapons can create unintended complications when deployed near busy airports. AP sources confirm the Pentagon had authorized Customs and Border Protection to use the laser system before the FAA shut down the airspace.\n\nMeanwhile, Trump's election security appointments continue raising eyebrows. The president has tapped an election denier to head election security efforts, while the House just passed a strict voter ID measure that amplifies Trump's fraud claims. It's part of a broader pattern of the administration reshaping election oversight in line with Trump's longstanding grievances about the 2020 race.\n\nBusiness/Tech\n\n• The IEA is cutting forecasts for global oil demand growth this year, Reuters reports, as economic uncertainties weigh on consumption expectations.\n\n• China is softening its stance on EU trade disputes, according to Reuters, allowing individual EV makers to negotiate separately with Brussels on tariffs.\n\n• Instagram's Adam Mosseri testified that social media isn't clinically addictive during a landmark trial examining tech platforms' impact on youth mental health.\n\n• OpenAI is wrestling with monetizing its AI technology as it faces mounting pressure to turn its massive investments into sustainable revenue streams.\n\nAround the World\n\n• Latin America: A top U.S. energy official is pressing Venezuela to create better conditions for foreign investment, particularly in the country's oil sector as Washington seeks to expand economic ties.\n\n• Europe: Former NATO ambassadors and generals are defending the alliance's importance to U.S. security as Trump continues questioning America's commitment to the transatlantic partnership.\n\n• Asia: The BBC reports that Kim Jong Un has chosen his teenage daughter as his heir apparent, with South Korea's intelligence agency pointing to Ki Ju Ae's increasingly prominent public appearances as evidence.\n\n• Middle East: Hamas would retain some weapons initially under a draft Gaza ceasefire plan currently being negotiated, officials tell the Times.\n\n• Africa: Senegalese authorities have arrested two celebrities as part of a broader government crackdown targeting the LGBTQ+ community in the West African nation.\n\nThat's your world update for today.",
  "size_kb": 2882
}