{
  "generated": "2026-02-15T12:54:51.817Z",
  "voice": {
    "id": "Xb7hH8MSUJpSbSDYk0k2",
    "name": "Alice",
    "accent": "British",
    "style": "clear educator"
  },
  "script": "Right then, here's what's happening in the world today.\n\nGood morning. Here's the state of play:\n\nWashington is grappling with a Homeland Security funding crisis that could affect everything from TSA operations to border security. The political standoff reflects broader tensions over immigration enforcement and government spending priorities that we've seen play out repeatedly this year.\n\nThe funding fight comes as the administration faces pushback on multiple fronts, from student walkouts protesting ICE operations to questions about secret deportations that appear to have bypassed legal protections. There's also growing scrutiny of how federal agencies are using surveillance tools, with reports that Homeland Security wants social media platforms to hand over information about accounts critical of immigration enforcement.\n\nBusiness/Tech\n\n• Companies are getting hammered by AI anxiety on earnings calls, even as corporate profits are actually growing strong this quarter, Bloomberg reports. Executives can't stop talking about AI disruption risks.\n\n• The government just gave Triso-X the green light to use a special type of uranium for reactor fuel production, according to Reuters. It's part of the push to revive nuclear energy with advanced reactor designs.\n\n• ECB President Christine Lagarde is pushing back against proposals to tax capital outflows from Europe, saying it's better to create investment incentives instead.\n\n• Translation jobs are getting an AI reality check in France, where romance novel publishers are testing whether artificial intelligence can handle the nuances of literary translation.\n\nAround the World\n\n• Latin America: Brazil just claimed its first ever Winter Olympic gold medal, part of a series of surprise victories by countries not traditionally associated with winter sports. Kazakhstan also grabbed an unexpected gold.\n\n• Europe: The BBC has a fascinating story about Iran being ready to discuss nuclear compromises, with Tehran's deputy foreign minister saying the ball is in America's court. Meanwhile, the UK says Russia killed Alexei Navalny using dart frog toxin.\n\n• Asia: Bangladesh's student revolution is being overshadowed by the rise of an Islamist party that's gaining political ground. The young activists who toppled the previous government are finding their secular agenda challenged.\n\n• Middle East: Al Jazeera reports at least 10 Palestinians were killed in Israeli strikes on Gaza in the past 24 hours, including six people in an attack on a tent encampment in the north.\n\n• Africa: A peace activist in South Sudan has been caught plotting a coup, a twist that highlights just how unstable the world's newest country remains more than a decade after independence.\n\nThat's your world update for today.",
  "size_kb": 3010
}