{
  "generated": "2026-02-05T07:43:54.421Z",
  "voice": {
    "id": "Xb7hH8MSUJpSbSDYk0k2",
    "name": "Alice",
    "accent": "British",
    "style": "clear educator"
  },
  "script": "Right then, here's what's happening in the world today.\n\nGood morning. Here's the state of play:\n\nWe're seeing a convergence around two major diplomatic stories that could reshape global dynamics. Trump's unpredictable approach to foreign policy is creating both opportunities and complications for the U.S., particularly as Xi pressed him on Taiwan during their latest phone call. This comes as Washington and Tehran prepare for crucial talks in Oman on Friday, following what Al Jazeera describes as \"a barrage of threats\" between the two countries.\n\nThe Epstein files continue to dominate headlines across major outlets, with new revelations creating political headaches on both sides of the Atlantic. In the U.S., the scandal has prompted Brad Karp's resignation as Paul Weiss chairman, while in Britain, it's fueling calls for Prime Minister Starmer's ouster over his handling of the Peter Mandelson connection. The files have revealed everything from powerful men's involvement to victims' disclosed names, keeping the story front and center globally.\n\nBusiness/Tech\n\n• The Washington Post axed more than 300 journalists in a massive downsizing that cuts a third of its staff, marking another brutal blow to legacy media.\n\n• Netflix's Sarandos faced skeptical lawmakers over the streaming giant's proposed Warner deal, as regulators scrutinize the consolidation of entertainment power.\n\n• Google's pulling ahead of OpenAI with what Reuters calls \"stellar AI growth,\" flipping from laggard to leader in the artificial intelligence race.\n\n• Bitcoin's tumbling as it approaches the key $70,000 threshold, showing just how volatile crypto markets remain.\n\nAround the World\n\n• Latin America: Venezuela's detaining Maduro allies who've been targeted by U.S. sanctions, suggesting internal fractures within the regime as international pressure mounts.\n\n• Europe: A Russian comedian got prison time for making jokes about veterans, showing how Moscow's crackdown on dissent now extends to even mild criticism wrapped in humor.\n\n• Asia: Two Chinese journalists were detained for reporting on corruption, as Beijing continues tightening its grip on press freedoms despite its anti-graft rhetoric.\n\n• Middle East: Beyond the U.S.-Iran talks, two staffers quit Human Rights Watch over a shelved report criticizing Israel, highlighting ongoing tensions within advocacy organizations over Middle East coverage.\n\n• Africa: Gunmen killed more than 160 people in Nigeria according to aid officials, underscoring the persistent security crisis plaguing Africa's most populous nation.\n\nThat's your world update for today.",
  "size_kb": 2821
}