{
  "generated": "2026-02-10T18:04:32.786Z",
  "voice": {
    "id": "Xb7hH8MSUJpSbSDYk0k2",
    "name": "Alice",
    "accent": "British",
    "style": "clear educator"
  },
  "script": "Right then, here's what's happening in the world today.\n\nGood morning. Here's the state of play:\n\nRepublicans are building a massive fundraising advantage heading into the midterms, threatening to overwhelm Democratic candidates with cash in what's shaping up to be a pivotal election cycle. The GOP's financial edge comes as several key races are taking shape, including Susan Collins' announcement that she'll seek re-election in Maine, a seat Democrats desperately need to flip to maintain any hope of Senate control.\n\nThe political landscape is shifting rapidly elsewhere too. In New Jersey, progressive activist Mejia has defeated incumbent Tom Malinowski in a special election, while Antonio Delgado has dropped out of New York's gubernatorial race entirely. These shifts reflect broader tensions within the Democratic party as it grapples with Trump's immigration enforcement policies, which continue to draw strong Republican support in polling.\n\nBusiness/Tech\n\n• Marriott is forecasting weak growth in room revenue as US travel demand stays sluggish, according to Reuters.\n\n• The EU Parliament has backed plans for a digital euro that would work both online and offline, Reuters reports.\n\n• Electronic Arts is buying back $1.5 billion in bonds through JPMorgan, Bloomberg notes, part of a massive $20 billion financing package tied to an acquisition.\n\n• Meta and YouTube are facing accusations in a landmark trial that they deliberately created \"digital casinos\" to hook users, while Google employees are demanding the company end its cloud contracts with immigration agencies.\n\nAround the World\n\n• Latin America: Mexico is caught in an awkward position as Trump threatens sanctions on any country that supplies oil to Cuba, putting pressure on a key bilateral relationship.\n\n• Europe: Olympic officials have banned a Ukrainian athlete from wearing a helmet honoring war dead, while Italy's state broadcaster faces a potential strike after an anchor confused athletes during Olympics coverage.\n\n• Asia: Malaysian durian farmers who struck it rich selling the prized fruit to China are now watching their harvests pile up as demand crashes.\n\n• Middle East: Gun violence within Israel's Arab community has sparked rare protests by Israeli citizens demanding government action, according to Al Jazeera reports of continued attacks in Gaza.\n\n• Africa: Senegal has arrested two celebrities in what appears to be an escalating government crackdown on homosexuality in the West African nation.\n\nThat's your world update for today.",
  "size_kb": 2765
}