{
  "generated": "2026-02-14T11:50:05.317Z",
  "voice": {
    "id": "Xb7hH8MSUJpSbSDYk0k2",
    "name": "Alice",
    "accent": "British",
    "style": "clear educator"
  },
  "script": "Right then, here's what's happening in the world today.\n\nGood morning. Here's the state of play:\n\nThe U.S. is grappling with a series of domestic security challenges that have international implications. A major debacle led to the complete closure of El Paso's airspace, highlighting coordination problems between the Pentagon and FAA over anti-drone operations along the Mexican border. The situation underscores broader tensions as the Department of Homeland Security has shut down due to funding disputes, leaving essential operations running but creating uncertainty for thousands of federal workers.\n\nMeanwhile, Secretary of State Rubio is working to reassure European allies at the Munich Security Conference, where world leaders are gathering for a second day of discussions. European officials are expressing cautious relief about Rubio's approach, though concerns remain about broader U.S. policy directions under the new administration.\n\nBusiness/Tech\n\n• Elon Musk's AI chatbot Grok is gaining market share despite facing backlash over sexualized image generation, according to Reuters.\n\n• China's chip industry has made significant strides but still faces major gaps in competing with Western technology, particularly in high-end semiconductor manufacturing.\n\n• Iran is deploying digital surveillance tools including facial recognition technology to track down protesters, expanding its crackdown capabilities.\n\n• Goldman Sachs' top lawyer departed following revelations about her connections to Jeffrey Epstein.\n\nAround the World\n\n• Latin America: The U.N. has condemned U.S. measures that halt oil deliveries to Cuba, marking an early diplomatic flashpoint over the new administration's Latin America policy.\n\n• Europe: Secretary of State Rubio delivered a major speech at the Munich Security Conference, stressing shared history with Europeans while warning of \"civilizational erasure.\"\n\n• Asia: Japan has released a Chinese boat captain after detaining him for 30 hours, defusing a potential diplomatic incident between the two countries.\n\n• Middle East: The Pentagon is preparing for possible war with Iran even as diplomatic efforts continue, with Reuters reporting that military planners are readying for potentially weeks-long operations.\n\n• Africa: The first U.S. troops have arrived in Nigeria to bolster counterterrorism operations, expanding American military presence in West Africa.\n\nThat's your world update for today.",
  "size_kb": 2605
}