{
  "generated": "2026-02-13T12:03:19.156Z",
  "voice": {
    "id": "Xb7hH8MSUJpSbSDYk0k2",
    "name": "Alice",
    "accent": "British",
    "style": "clear educator"
  },
  "script": "Right then, here's what's happening in the world today.\n\nGood morning. Here's the state of play:\n\nBangladesh has wrapped up its first free election since protesters toppled the authoritarian Sheikh Hasina in 2024, and the results are reshaping the country's political landscape. The Bangladesh Nationalist Party secured a commanding two-thirds majority with 204 of 300 parliamentary seats, though the Islamist Jamaat-e-Islami party is expressing dissatisfaction with the vote count, according to Al Jazeera. It's a pivotal moment for a nation that endured 15 years of increasingly despotic rule.\n\nMeanwhile, European leaders are bracing for what could be a tense transatlantic reckoning at the Munich Security Conference, where Secretary of State Marco Rubio is expected to deliver his first major address to European allies. The BBC reports that Rubio has already warned of a \"new era in geopolitics,\" setting the stage for what many see as a crucial test of NATO unity after Trump's recent threats to annex Greenland. The timing couldn't be more fraught, with European officials openly nervous about America's commitment to traditional alliance structures.\n\nBusiness/Tech\n\n• Goldman Sachs saw its top lawyer Kathryn Ruemmler resign following revelations about her connections to Jeffrey Epstein, marking another high-profile departure tied to the disgraced financier's expanding web of influence.\n\n• Anthropic launched a $20 million super PAC operation specifically designed to counter OpenAI's growing political influence, escalating the AI industry's Washington lobbying wars.\n\n• Oil prices are sliding toward their first back-to-back weekly decline this year, with Bloomberg reporting that some OPEC+ nations are eyeing potential production increases.\n\n• GE Aerospace is turning to robots and lean manufacturing to tackle a massive backlog in jet engine repairs, per Reuters.\n\nAround the World\n\n• Latin America: A Venezuelan politician in exile is being held by ICE and fears deportation back to Venezuela, where he could face persecution under the Maduro government.\n\n• Europe: A UK high court has ruled unlawful the government's ban on the pro-Palestinian group Palestine Action, dealing a significant blow to Prime Minister Starmer's handling of Gaza-related activism.\n\n• Asia: Pakistan and India's cricket rivalry is heating up again, with both nations threatening to boycott each other's World Cup matches as diplomatic tensions spill onto the pitch.\n\n• Middle East: Iran has deployed sophisticated digital surveillance including facial recognition technology to hunt down protesters, as AP reports the death toll from the regime's crackdown has now exceeded 7,000.\n\n• Africa: Israel is shaking up the geopolitical balance in the Horn of Africa with new moves involving Somaliland, even as the US continues bombing operations in Somalia.\n\nThat's your world update for today.",
  "size_kb": 3155
}